Repository: loginom/site-articles-en-omegat
Catalog: omegat/project_save.tmx
Source language: ru
Languages: en

source: Например, соответствие между столбцами могло формироваться на основе частичного, а не полного совпадения имен столбцов (#8456).
en: For example, columns mapping could be established on the basis of the partial but not full mapping of the columns names (#8456).

source: Например, такой подход может использоваться при построении модели оценки рисков в кредитовании, когда в качестве веса может быть задана сумма кредита.
en: For example, such approach can be used to train the model of risks assessment in the sphere of crediting when the credit sum can be set as the weight.

source: Например: при наличии активных процессов нельзя было отключить этот параметр, а при попытке вызвать пункт контекстного меню «Удалить из списка» панель процессов могла «зависнуть» (#8339, #8446 #8447).
en: For example, in the case of active processes, it was not possible to disable this parameter, and while attempting to call "Remove from list" context menu item, the Processes Bar could be frozen (#8339, #8446 #8447).

source: Настольные редакции Loginom теперь доступны и для Linux.
en: Now the desktop Loginom editions are also available for Linux.

source: Настольные редакции под Linux
en: Desktop Editions for Linux

source: Настроенные таким образом сценарии будут независимы от языковых настроек Windows и Loginom.
en: The workflows configured in such a way won't be dependent on the language Windows and Loginom settings.

source: Настройка измерений Куба в отдельном окне
en: Configuring the Cube dimensions in a separate window

source: Настройка локали для пакета и сервера.
en: Locale configuration for package and server.

source: Настройка поправки на соотношение событий к не-событиям
en: Configuration of events to non-events ratio correction

source: Настройка экспорта в Хранилище данных
en: Configuring export to the Data Warehouse

source: Настройка" возникла ошибка.
en: Configuration", the error occurred.

source: Начиная с версии 6.5.0, узлы Выполнение узла и Цикл ссылаются не на узел, а на компонент.
en: Starting from 6.5.0 version Node Execution and Loop nodes refer not to the node but to the component.

source: Не поддерживается браузер Internet Explorer.
en: Internet Explorer browser is not supported.

source: Не поддерживаются 32-разрядные операционные системы семейства Windows.
en: The 32-bit version of Windows operating systems is not supported.

source: Не поддерживаются модули пакета multiprocessing, используемые для реализации параллельной работы через создание нескольких процессов, а также зависимые от них сторонние пакеты.
en: Multiprocessing package modules used for parallel operation by creating several processes and also third-party packages dependent on them are not supported.

source: Не удается найти указанный файл» (#7978).
en: Failed to find the specified file» (#7978).

source: Не удалось выделить в списке, т.к. не соответствует фильтру».
en: Failed to select in the list because it does not match the filter".

source: Нейросеть (классификация)
en: Neural Network (Classification)

source: Нейросеть (регрессия)
en: Neural Network (Regression)

source: Некоторые из этих компонентов могут оказаться лишними, если в других пакетах нет и не планируется создавать узлы Выполнение узла или Цикл, которые на них ссылаются.
en: Some of these components can become excessive if there are no Node Execution or Loop nodes that refer to them in other packages, and it is not planned to create them.

source: Нельзя выполнять команды для работы с GUI (graphical user interface, графическим пользовательским интерфейсом).
en: It is not allowed to run the commands to work with GUI (graphical user interface, graphic user interface).

source: Несколько менее существенных, но важных улучшений пользовательского интерфейса:
en: The following less significant but still important improvements were also achieved:

source: Нет встроенной интеграции с MS Access из-за отсутствия open source драйверов.
en: There is no built-in integration with MS Access because open source driver is not available.

source: Ниже приведен список наиболее важных изменений:
en: The most important changes are listed below:

source: Ниже приведено описание наиболее важных изменений.
en: The most important changes are described below.

source: Но в данной ситуации текст сообщения должен быть: "Не указана таблица базы данных".
en: But in this case the message text must be read as follows: "Database table was not specified".

source: Но, если задана переменная окружения DOTNET_RUNNING_IN_CONTAINER со значением true или 1 (т.е. Integrator запущен из Docker контейнера), то в логируемых сообщениях не пишется текущая дата/время.
en: But if DOTNET_RUNNING_IN_CONTAINER environment variable is set with true or 1 value (namely, Integrator was started from Docker container), the current date/time is not recorded in the logged messages.

source: Новая страница «Веб-сервисы»
en: New "Web Services" Page

source: Новшества в переиспользовании компонентов
en: Components Reuse Novelties

source: Новые возможности в стандартных компонентах
en: New Opportunities in Standard Components

source: Новые возможности появились в обработчике JavaScript, при импорте данных из файлов, в визуализаторе OLAP-куб и в Отчетах.
en: New features appeared in JavaScript handler when importing data from files as well as in OLAP cube visualizer and Reports.

source: Новые параметры в разделе Администрирование
en: New Parameters in the Administration Section

source: Новый визуализатор — Качество данных.
en: New visualizer — Data Quality.

source: Новый визуализатор — Качество данных
en: New Visualizer — Data Quality

source: О всех изменениях в новой версии можно узнать на официальном сайте.
en: More detailed information on all changes of the new version is available on the official site.

source: Обновленный мастер настройки импорта из базы данных
en: Updated import from database wizard

source: Обработка не запускалась (#8885).
en: Processing was not started (#8885).

source: Обработчик «Калькулятор»
en: Calculator Handler

source: Обработчик «Конечные классы»
en: Coarse Classes Handler

source: Обработчик «Редактирование выбросов»
en: Eliminate Outliers Handler

source: Обработчик «Условие»
en: Condition Handler

source: Обработчик «Цикл»
en: Loop Handler

source: Обработчик Дубликаты и противоречия.
en: Duplicates Detection Handler.

source: Обработчики REST и SOAP-запрос функционируют без изменений.
en: REST and SOAP request handlers function without changes.

source: Обратите внимание!
en: Please note!

source: Ограничения Loginom под Linux
en: Loginom Restrictions for Linux

source: Однако при переносе сценариев между Loginom под Windows и Linux, в некоторых случаях потребуется перенастройка подключений REST и SOAP-сервис.
en: However, when transferring workflows between Loginom for Windows and Linux, in some cases it will be required to reconfigure REST connections and SOAP service.

source: Она возникала нерегулярно в редакциях под Linux и не имела точных шагов воспроизведения (#10179).
en: It occurred irregularly in the editions for Linux, and there were no exact reproduction steps (#10179).

source: Она появилась в версии 7.0.0.
en: It appeared in version 7.0.0.

source: Оно появлялось в версии 7.0.0.
en: It occurred in version 7.0.0.

source: Оптимизация применяется для всех типов данных, кроме Переменного, и будет включена при любом из условий:
en: Optimisation is applied for all data types with the exception of the Varibale one, and it will be enabled under any of the following conditions:

source: Оптимизация работы
en: Performance Improvements

source: Оптимизирован расход памяти (#9054).
en: Memory consumption was optimized (#9054).

source: Оптимизированы существующие алгоритмы.
en: The existing algorithms were optimized.

source: Опциональные возможности Loginom под Linux
en: Optional Loginom Features for Linux

source: Опция активируется при нажатии иконки «Предпросмотр» на панели инструментов в мастере Калькулятора.
en: The option is activated when pressing the "Preview" toolbar icon in the Calculator wizard.

source: Опция запускается при активации режима «Быстрый просмотр» в правом углу панели инструментов, по двойному клику по выходному порту узла или через пункт «Увеличенный быстрый просмотр» контекстного меню порта.
en: The option is started when activating the "Quick view" mode in the right toolbar corner by double clicking on the output node port or using "Advanced quick view" item of the context port menu.

source: Основной кейс использования Python — встраивание расчетов, реализованных на Python в существующий сценарий анализа данных.
en: The main Python use case is to imbed the Python calculations into the existing data analysis workflow.

source: Особенно часто это могло доставлять неудобства, если в экспортируемых наборах встречались поля с артикулами товаров, начинающихся с нулей.
en: Frequently it was particularly inconvenient if the fields with item numbers that started from zeros occurred in the exported data sets.

source: Остальные показатели при этом отображаются как Не вычислено.
en: Other indicators are displayed as follows: Not calculated.

source: Отмена выполнения запроса в процессе импорта из БД.
en: Cancelation of the request execution while importing from the DB.

source: Отмечать и снимать выделение можно по клику на специальный элемент слева от поля (CheckBox), перемещение по полям не изменяет состояние этого элемента (#9337).
en: It is possible to select and deselect by clicking on the special element to the left from the field (CheckBox), movements in the fields don't change the state of this element (#9337).

source: Относительный путь к рабочей директории Интегратора определяется относительно файла конфигурации.
en: The relative path to the work Integrator directory is defined relative to the configuration file.

source: Отображаемые серии
en: Displayed Series

source: Отсутствует интеграция с 1С:Предприятие через COM-соединение, т.к. COM-сервер работает только под Windows.
en: There is no integration for 1С:Enterprise via COM connection because COM server is available only for Windows.

source: Отсутствует обработчик Выполнение программы, который используется для запуска внешних Windows-программ.
en: There is no Program execution handler that is used to start the external Windows programs.

source: Отсутствует экспорт в Tableau.
en: There is no export to Tableau.

source: Отчет по линейной регрессии
en: Linear Regression Report

source: Отчет по логистической регрессии
en: Logistic Regression Report

source: Ошибка была связана с тем, что в создаваемом файле env.conf параметр WS_PROXY_URI был задан как ws/.
en: The error was caused by the fact that WS_PROXY_URI parameter in the created env.conf file was set as ws/.

source: Ошибка возникала в версии 6.4.2 (#8629).
en: The error occurred in version 6.4.2 (#8629).

source: Ошибка возникала в настольной версии Loginom.
en: The error occurred in the desktop Loginom version.

source: Ошибка возникала из-за отсутствия многострочного экспорта в MSSQL 2005.
en: The error was caused by unavailability of the multirow export to MSSQL 2005.

source: Ошибка возникала при запуске специально подготовленных сценариев.
en: The error occurred when starting specially prepared workflows.

source: Ошибка воспроизводилась при выполнении узла «Python» в цикле с групповой обработкой.
en: The error was shown when executing "Python" node in the loop with the group processing.

source: Ошибка воспроизводилась редко.
en: The error occurred seldom.

source: Ошибка исправлена (#10096).
en: The error was corrected (#10096).

source: Ошибка исправлена (#10123).
en: The error was corrected (#10123).

source: Ошибка исправлена (#9101).
en: The error was corrected (#9101).

source: Ошибка исправлена (#9896).
en: The error was corrected (#9896).

source: Ошибка могла возникнуть при активации подключения к Хранилищу данных, у которого длинный (более 25) список объектов (#9154).
en: The error could occur when connection to the Data storage with the long list of objects (more than 25) was activated (#9154).

source: Ошибка могла встречаться и при настроке других узлов, но значительно реже (#8477).
en: This error could occur when configuring other nodes but much less frequently (#8477).

source: Ошибка наблюдалась в браузерах на базе Chromium, в Internet Explorer и в Safari (#7108, #8058, #8499).
en: The error occurred in the browsers based on Chromium, in Internet Explorer and Safari (#7108, #8058, #8499).

source: Ошибка наблюдалась, если Loginom установлен под Linux в Docker контейнерах и при установке была включена поддержка SSL.
en: The error occured if Loginom was installed for Linux in Docker containers, and SSL support was enabled while installing.

source: Ошибка никак не влияла на работу приложения (#9579).
en: The error had no effect on the application operation (#9579).

source: Ошибка появилась в версии 7.0.0 (#9719).
en: The error appeared in version 7.0.0 (#9719).

source: Ошибка появилась в версии 7.0.0.
en: The error appeared in version 7.0.0.

source: Ошибка появлялась при нажатии "Тестировать" или "Активировать подключение" в мастере настройки подключения, если элементы импортируемой схемы содержали атрибуты и она находилась во вложенной на несколько уровней папке Файлового хранилища (#9631).
en: The error appeared when pressing "Test" or "Activate connection" in the connection wizard if the imported schema items contained attributes, and it was located in the File storage folder nested on several levels (#9631).

source: Ошибка регрессионная и появилась в версии 7.0.0 (#10024).
en: It is a regression error and it appeared in version 7.0.0 (#10024).

source: Ошибка регрессионная и появилась в версии 7.0.0 (#10025).
en: It is a regression error and it appeared in version 7.0.0 (#10025).

source: Ошибка регрессионная и появилась в версии 7.0.0 (#9996).
en: It is a regression error and it appeared in version 7.0.0 (#9996).

source: Ошибка регрессионная и появилась в версии 7.0.0.
en: It is a regression error and it appeared in version 7.0.0.

source: Ошибка регрессионная, появилась в версии 7.0.0 и наблюдалась при подключении к Oracle без использования клиента (#10029).
en: It is a regression error, it appeared in version 7.0.0. It was observed when connecting to Oracle without client use (#10029).

source: Ошибка регрессионная.
en: It is a regression error.

source: Ошибка устранена (#9035).
en: The error was corrected (#9035).

source: Ошибки исправили (#10029).
en: The errors were corrected (#10029).

source: Ошибки исправили (#10077).
en: The errors were corrected (#10077).

source: Ошибки исправили (#9179).
en: The errors were corrected (#9179).

source: Ошибки исправили (#9692, #9689).
en: The errors were corrected (#9692, #9689).

source: Ошибки исправили.
en: The errors were corrected.

source: Ошибку исправили (#10002).
en: The error was corrected (#10002).

source: Ошибку исправили (#10004).
en: The error was corrected (#10004).

source: Ошибку исправили (#10006).
en: The error was corrected (#10006).

source: Ошибку исправили (#10014).
en: The error was corrected (#10014).

source: Ошибку исправили (#10043).
en: The error was corrected (#10043).

source: Ошибку исправили (#10166).
en: The error was corrected (#10166).

source: Ошибку исправили (#5133).
en: The error was corrected (#5133).

source: Ошибку исправили (#6246).
en: The error was corrected (#6246).

source: Ошибку исправили (#7275).
en: The error was corrected (#7275).

source: Ошибку исправили (#7612).
en: The error was corrected (#7612).

source: Ошибку исправили (#8679).
en: The error was corrected (#8679).

source: Ошибку исправили (#9268).
en: The error was corrected (#9268).

source: Ошибку исправили (#9453).
en: The error was corrected (#9453).

source: Ошибку исправили (#9504).
en: The error was corrected (#9504).

source: Ошибку исправили (#9549).
en: The error was corrected (#9549).

source: Ошибку исправили (#9553).
en: The error was corrected (#9553).

source: Ошибку исправили (#9617).
en: The error was corrected (#9617).

source: Ошибку исправили (#9693).
en: The error was corrected (#9693).

source: Ошибку исправили (#9694).
en: The error was corrected (#9694).

source: Ошибку исправили (#9727).
en: The error was corrected (#9727).

source: Ошибку исправили (#9763).
en: The error was corrected (#9763).

source: Ошибку исправили (#9768).
en: The error was corrected (#9768).

source: Ошибку исправили (#9772).
en: The error was corrected (#9772).

source: Ошибку исправили (#9775).
en: The error was corrected (#9775).

source: Ошибку исправили (#9778).
en: The error was corrected (#9778).

source: Ошибку исправили (#9883, #5734).
en: The error was corrected (#9883, #5734).

source: Ошибку исправили (#9887).
en: The error was corrected (#9887).

source: Ошибку исправили (#9905).
en: The error was corrected (#9905).

source: Ошибку исправили (#9933).
en: The error was corrected (#9933).

source: Ошибку исправили (#9960, #9888).
en: The error was corrected (#9960, #9888).

source: Ошибку исправили, проверка правил на минимальную достоверность выполняется с точностью до целых процентов (#10091).
en: The error was corrected. The rules were checked for the minimum reliability with the accuracy up to the whole percentage (#10091).

source: Ошибку исправили.
en: The error was corrected.

source: Ошибку можно было получить запуская специально подготовленные сценарии.
en: The error could occur when starting specially prepared workflows.

source: Ошибку можно было получить после повторного открытия пакета и активации обученной нейросети, а также если активировать клон такой нейросети (#10137).
en: The error could occur after repeated opening of the package and activation of the trained neural network, and also if the clone of such neural network was activated (#10137).

source: Ошибку сохранения координат исправили (#10097).
en: The error of coordinates saving was corrected (#10097).

source: Ошибку экспорта исправили (#9683).
en: The export error was corrected (#9683).

source: Ошибочное поведение исправили (#10112).
en: Error of behavior was corrected (#10112).

source: Ошибочное поведение исправили (#10168).
en: Error of behavior was corrected (#10168).

source: Ошибочное поведение исправили (#10226).
en: Error of behavior was corrected (#10226).

source: Ошибочное поведение исправили (#10269).
en: Error of behavior was corrected (#10269).

source: Ошибочное поведение исправили (#10316).
en: Error of behavior was corrected (#10316).

source: Ошибочное поведение исправили (#4908).
en: Error of behavior was corrected (#4908).

source: Ошибочное поведение исправили (#6139).
en: Error of behavior was corrected (#6139).

source: Ошибочное поведение исправили (#6528).
en: Error of behavior was corrected (#6528).

source: Ошибочное поведение исправили (#6805).
en: Error of behavior was corrected (#6805).

source: Ошибочное поведение исправили (#7509).
en: Error of behavior was corrected (#7509).

source: Ошибочное поведение исправили (#7752).
en: Error of behavior was corrected (#7752).

source: Ошибочное поведение исправили (#8104).
en: Error of behavior was corrected (#8104).

source: Ошибочное поведение исправили (#8306).
en: Error of behavior was corrected (#8306).

source: Ошибочное поведение исправили (#8662).
en: Error of behavior was corrected (#8662).

source: Ошибочное поведение исправили (#9285).
en: Error of behavior was corrected (#9285).

source: Ошибочное поведение исправили (#9660).
en: Error of behavior was corrected (#9660).

source: Ошибочное поведение исправили (#9675).
en: Error of behavior was corrected (#9675).

source: Ошибочное поведение исправили (#9803).
en: Error of behavior was corrected (#9803).

source: Ошибочное поведение исправили (#9851).
en: Error of behavior was corrected (#9851).

source: Ошибочное поведение исправили (#9929).
en: Error of behavior was corrected (#9929).

source: Ошибочное поведение исправили (#9948).
en: Error of behavior was corrected (#9948).

source: Ошибочное поведение исправили (#9955).
en: Error of behavior was corrected (#9955).

source: Ошибочное поведение исправили, время модификации файла при копировании не изменяется (#9951).
en: Error of behavior was corrected, time of file modification while copying was not changed (#9951).

source: Ошибочное поведение исправили.
en: Error of behavior was corrected.

source: Ошибочное поведение исправили: если перемещать нечего, то кнопки недоступны (#10013).
en: Error of behavior was corrected. If there is nothing to move, the buttons are not available (#10013).

source: Пакет содержит активные процессы, которые не завершились в течение таймаута.», а при попытке повторно открыть такой пакет, он открывался с доступом только на чтение (#8670).
en: The package contains active processes not finished during timeout", and while attempting to open such package repeatedly, it was read-only opened (#8670).

source: Пакетное выполнение
en: Batch Processing

source: Пакеты из предыдущих версий будут работать по-старому, до тех пор, пока не будет выключена настройка «Уникальные значения как имена полей».
en: The previous version packages will be used in the same way until "Unique values as field names" setting is enabled.

source: Пакеты сохраняются с заданным интервалом в файлы с расширением .autosave рядом с .lgp файлами.
en: The packages are saved with the set intervals in the files with .autosave extension near .lgp files.

source: Панель «Отчеты» в Loginom
en: Reports Bar in Loginom

source: Панель Диспетчер раздела Администрирование
en: Session Manager Bar of the Administration Section

source: Панель Диспетчер раздела Администрирования
en: Session Manager Bar of the Administration Section

source: Панель процессов в Loginom
en: Processes Bar in Loginom

source: Параметр Контрольная сумма
en: Control Sum parameter

source: Параметры «Коэффициент Вальда» и «Критерий Вальда» переименованы в параметр «Статистика Вальда», а «Коэффициент детерминации» переименован в «Псевдо-R² Макфаддена»
en: Such parameters as "Wald Coefficient" and "Wald criterion" were renamed into "Wald statistic" parameter, and "R^2" was renamed into "McFadden pseudo-R²".

source: Перед открытием новой версии рекомендуем отдельно сохранить копии обновляемых пакетов.
en: It is recommended to save copies of the updated packages separately before new version opening.

source: Перед тем, как открывать в новой версии Loginom пакеты, разработанные в предыдущих версиях платформы, рекомендуется сделать резервные копии исходных пакетов.
en: Before opening the packages designed in the previous platform versions in the new platform version, it is recommended to make backup copies of the source packages.

source: Перезапуска сервера при этом не требуется, но активация параметра вступает в силу с небольшой задержкой.
en: Server restart is not required in this case but parameter is enabled with a slight delay.

source: Переработан интерфейс быстрого просмотра (#9065).
en: Quick view interface was improved (#9065).

source: По достижению максимального числа коэффициентов об этом будет записано сообщение в лог (#7968).
en: When the maximum number of coefficients is reached, it will be recorded in the log message (#7968).

source: По нажатию на Ctrl+C, выделенные в окне быстрого просмотра данные теперь копируются в совместимом с Excel формате, то есть при вставке в табличный редактор, вставляемые значения будут иметь корректный формат данных.
en: When pressing on Ctrl+C, the data selected in the quick view window is currently copied in the Excel compatible format. Namely, when inserting to the table editor, the inserted values will have the correct data format.
